/* Напишіть програму, яка перевіряє, чи є введене число парним або непарним.
Оголосіть змінну number та присвойте їй будь-яке числове значення.
Використовуючи конструкцію if...else, перевірте:
Якщо число парне (ділиться на 2 без залишку), виведіть "Число X є парним" в консоль.
Якщо число непарне, виведіть "Число X є непарним" в консоль.
Перевірте роботу коду для кількох значень.
*/

let number = Math.floor(Math.random()*50);
if (number % 2 === 0) {
    console.log(`number ${number} - even`)
} else {
    console.log(`number ${number} is odd`)
}